plstms-pls20-e49a48c5bd95/backend/ltl-rating/request.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetRate2 xmlns="http://dayrossgroup.com/web/public/webservices/shipmentServices">
      <division>GeneralFreight</division>
      <emailAddress>tnapierkowski@plslogistics.com</emailAddress>
      <password>PWD144633</password>
      <shipment>
        <ShipperAddress>
          <City>STONEY CREEK</City>
          <Country>CA</Country>
          <PostalCode>L8E2N9</PostalCode>
          <Province>ON</Province>
        </ShipperAddress>
        <ConsigneeAddress>
          <City>HAMILTON</City>
          <Country>CA</Country>
          <PostalCode>L8L7W9</PostalCode>
          <Province>ON</Province>
    </ConsigneeAddress>
    <BillToAccount>144633</BillToAccount> 
        <Items>
          <ShipmentItem>
            <Description>Rate Shipping</Description>
            <Height>46</Height>
            <Length>128</Length>
            <LengthUnit>Inches</LengthUnit>
            <Pieces>1</Pieces>
            <Weight>918</Weight>
            <WeightUnit>Pounds</WeightUnit>
            <Width>38</Width>
          </ShipmentItem>
        </Items>
        <SpecialServices>
               <ShipmentSpecialService>
                  <Code>INBOND</Code>
                  <AccessorialValue>100</AccessorialValue>
               </ShipmentSpecialService>
               <ShipmentSpecialService>
                  <Code>PRESDL</Code>
                  <AccessorialValue>100</AccessorialValue>
               </ShipmentSpecialService>
        </SpecialServices>
        <ShipmentType>Quote</ShipmentType>   
        <PaymentType>Prepaid</PaymentType>
        <MeasurementSystem>Imperial</MeasurementSystem>
        <Division>GeneralFreight</Division> 

      </shipment>
    </GetRate2>
  </soap:Body>
</soap:Envelope>